Revit 2027 API
AdaptiveComponentInstanceUtils.SetInstanceFlipped Method
 Sets the value of the flip parameter on the adaptive instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetInstanceFlipped(
	FamilyInstance famInst,
	bool flip
)
Public Shared Sub SetInstanceFlipped (
	famInst As FamilyInstance,
	flip As Boolean
)
public:
static void SetInstanceFlipped(
	FamilyInstance^ famInst,
	bool flip
)
static member SetInstanceFlipped :
        famInst : FamilyInstance *
        flip : bool -> unit
Parameters
famInst FamilyInstance
 The FamilyInstance
flip Boolean
 The flip flag
Exceptions
Exception | Condition
ArgumentException |  The FamilyInstance famInst is not an Adaptive Family Instance. -or- The FamilyInstance famInst does not have an Adaptive Family Symbol. -or- The FamilyInstance famInst cannot be flipped or unflipped.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This operation failed.
See Also
Reference
AdaptiveComponentInstanceUtils Class
Autodesk.Revit.DB Namespace